Masmiseim36/Kinetis/targets/Kinetis/CMSIS/MK61F12WS.h
/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #pragma pop
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


/* ----------------------------------------------------------------------------
   -- Backward Compatibility
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Backward_Compatibility_Symbols Backward Compatibility
 * @{
 */

#define PDB0_PO0EN                               PDB0_POEN
#define PMC_REGSC_BGEN_MASK                      0x10u
#define PMC_REGSC_BGEN_SHIFT                     4
#define SIM_SCGC4_IIC2_MASK                      SIM_SCGC4_IIC0_MASK
#define SIM_SCGC4_IIC2_SHIFT                     SIM_SCGC4_IIC0_SHIFT
#define SIM_SCGC6_FTFE_MASK                      0x1u
#define SIM_SCGC6_FTFE_SHIFT                     0
#define SIM_SCGC7_PFLEXNVM_MASK                  0x4u
#define SIM_SCGC7_PFLEXNVM_SHIFT                 2
#define DRY_LR_KSL_MASK                          0x1u
#define DRY_LR_KSL_SHIFT                         0
#define DRY_CR_THYD_MASK                         DRY_CR_THYS_MASK
#define DRY_CR_THYD_SHIFT                        DRY_CR_THYS_SHIFT

/*!
 * @}
 */ /* end of group Backward_Compatibility_Symbols */


#endif  /* #if !defined(MK61F12WS_H_) */

/* MK61F12WS.h, eof. */
